#Область СлужебныеПроцедурыИФункции
Процедура erp_ОбработатьДокументы(Параметры, АдресРезультата) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ ДАТАВРЕМЯ(2023, 1, 1) И ДАТАВРЕМЯ(2023, 1, 25)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	ТекДок = 1;
	ВсегоДокументов = РезультатЗапроса.Количество();
		
	Для Каждого СтрДок Из РезультатЗапроса Цикл
		
		ОбъектДок = СтрДок.Ссылка.ПолучитьОбъект();
		
		Если ОбъектДок.ПометкаУдаления Тогда 
			ОбъектДок.ПометкаУдаления = Ложь; 
		Иначе 
			ОбъектДок.ПометкаУдаления = Истина;
		КонецЕсли;
		ОбъектДок.Проведен = Ложь;
		
		Попытка
			ОбъектДок.Записать();
		Исключение       
			Сообщить("" + ОбъектДок.Ссылка + " " + ОписаниеОшибки());
		КонецПопытки;
		
		ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100;
		ПроцентВыполнения = Окр(ПроцентВыполнения,0);
		
		// сообщаем "процент" и "текст сообщения"
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СокрЛП(ОбъектДок.Ссылка));
		
		ТекДок = ТекДок + 1;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
	
