#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает список всех используемых в информационной базе систем налогообложения
//
// Параметры:
//  ВидОрганизации         - Строка - имя вида организации
//  СистемаНалогообложения - Строка - имя системы налогообложения
//
// Возвращаемое значение:
//  Структура - где ключ - имя ресурса регистра УчетнаяПолитикаНалоговыйУчет
//
Функция СтруктураУчетнойПолитики(ВидОрганизации, СистемаНалогообложения) Экспорт
	
	СтруктураУчетнойПолитики = Новый Структура;
	
	Если СистемаНалогообложения = "Патент" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.Патент);
		
	ИначеЕсли СистемаНалогообложения = "УпрощеннаяДекларация" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Ложь);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.УпрощеннаяДекларация);
		
	ИначеЕсли СистемаНалогообложения = "ФиксированныйВычет" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.ФиксированныйВычет);
		
	Иначе
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Истина);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.Общеустановленный);
		
	КонецЕсли;
	
	Возврат СтруктураУчетнойПолитики;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
	
#КонецЕсли

