
&НаСервере
Процедура ЗакрытьСессиюНаСервере(ПараметрыСессии, ПарольСохранен, Пароль = Неопределено)
	
	ПараметрыЭСФ = ЭСФСерверПовтИсп.ПолучитьПараметрыЭСФ();
	ВерсияИСЭСФ = ПараметрыЭСФ.ВерсияИСЭСФ;
	
	ОбработкаОбменЭСФ = ЭСФСерверПовтИсп.ОбработкаОбменЭСФ();
	Если ПарольСохранен Тогда
		ОбработкаОбменЭСФ.ЗакрытьСессию(ПараметрыСессии.Профиль, ПараметрыСессии.Идентификатор, ВерсияИСЭСФ, Истина);
	Иначе
		ОбработкаОбменЭСФ.ЗакрытьСессию(ПараметрыСессии.Профиль, ПараметрыСессии.Идентификатор, ВерсияИСЭСФ, Истина, Пароль);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСессию(Команда)
	
	ДанныеСессии  = Элементы.Список.ТекущиеДанные;
	ПрофильИСЭСФ  = ДанныеСессии.ПрофильИСЭСФ;
	Идентификатор = ДанныеСессии.IDСессии;
	
	ПараметрыСессии = Новый Структура("Профиль, Идентификатор", ПрофильИСЭСФ, Идентификатор);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		
		ПарольСохранен = ПроверитьНаличиеПароля(ПрофильИСЭСФ);
		
		Если ПарольСохранен Тогда
			ЗакрытьСессиюНаСервере(ПараметрыСессии, ПарольСохранен);
		Иначе
				
			Пользователь = ПолучитьПользователяПоПрофилю(ПрофильИСЭСФ);
			ПользователиИСЭСФ = Новый Массив;      
			ПользователиИСЭСФ.Добавить(Пользователь);
			
			ПараметрыСессии.Вставить("Пользователь", Пользователь );
			ОбработчикОповщенияВыбораДанных = Новый ОписаниеОповещения("ОбработчикОповщенияЗакрытьФормуВводПароля", ЭтаФорма, ПараметрыСессии);
			
			ЭСФКлиент.ПаролиАутентификации(ОбработчикОповщенияВыбораДанных, ПользователиИСЭСФ);
		КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр(
			"ru = 'Выбранная сессия уже закрыта!'");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователяПоПрофилю(Профиль)
	
	Возврат Профиль.Владелец;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикОповщенияЗакрытьФормуВводПароля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда	
		
		ПарольАутентификации = Результат[ДополнительныеПараметры.Пользователь];
		
		ЗакрытьСессиюНаСервере(ДополнительныеПараметры, Ложь, ПарольАутентификации);
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеПароля(ПрофильИСЭСФ)
	
	Если ЗначениеЗаполнено(ПрофильИСЭСФ.Владелец.ПарольАутентификации) Тогда
		ПарольСохранен = Истина;
	Иначе
		ПарольСохранен = Ложь;
	КонецЕсли;
		
	Возврат ПарольСохранен;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ЗакрытьСессию.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.ИмяМодуля = "ESF" Тогда
		Элементы.ЗакрытьСессию.Доступность = Истина;
	Иначе
		Элементы.ЗакрытьСессию.Доступность = Ложь;
	КонецЕсли;
		
КонецПроцедуры
