
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Контейнер = ЭСФКлиентСервер.КонтейнерМетодов();	
	Контейнер.ПриОткрытииФормы(ЭтаФорма, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	УправлениеФормой(ЭтаФорма)
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДляСинхронизацииПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);	
	
	ИспользоватьДляСинхронизацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;	
	Объект = Форма.Объект;
	
	Элементы.ИспользоватьДляРегламентногоЗадания.Видимость = Объект.ИспользоватьДляСинхронизации;
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьДляСинхронизацииПриИзмененииНаСервере()
	
	Если НЕ Объект.ИспользоватьДляСинхронизации Тогда
		Объект.ИспользоватьДляРегламентногоЗадания = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСессию(Команда)
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		
		ОбработчикОповщенияВыбораДанных = Новый ОписаниеОповещения("ОбработчикОповщенияЗакрытьФормуВводПароля", ЭтаФорма);
		
		ПользователиИСЭСФ = Новый Массив;
		ПользователиИСЭСФ.Добавить(Объект.Владелец);
		
		ЭСФКлиент.ПаролиАутентификации(ОбработчикОповщенияВыбораДанных, ПользователиИСЭСФ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповщенияЗакрытьФормуВводПароля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда			
		ПарольАутентификации = Результат[Объект.Владелец];
		ЗакрытьВыбраннуюСессиюНаСервере(Объект.Ссылка,ПарольАутентификации);				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьВыбраннуюСессиюНаСервере(Профиль, Пароль)
	
	ЭСФСервер.ЗакрытьСессиюПоДаннымПрофиля(Профиль, Пароль);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСессию(Команда)
	
	Если ЭСФКлиент.ОбъектЗаписан(ЭтаФорма) Тогда
		
		ОбработчикОповщенияВыбораДанных = Новый ОписаниеОповещения("ОбработчикОповщенияВыбораДанных", ЭтаФорма);		
		ПользователиИСЭСФ = Новый Массив;
		ПользователиИСЭСФ.Добавить(Объект.Владелец);		
		ЭСФКлиент.ПаролиАутентификации(ОбработчикОповщенияВыбораДанных, ПользователиИСЭСФ);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповщенияВыбораДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда					
		ОткрытьСессиюПоПрофилю(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОткрытьСессиюПоПрофилю(Профиль)
	
	ДанныеПрофиляИСЭСФ = ЭСФСервер.ДанныеПрофиляИСЭСФ(Профиль);	
	
	ИдентфикаторСессии = ЭСФСервер.ОткрытьСессию(ДанныеПрофиляИСЭСФ);
	Если ЗначениеЗаполнено(ИдентфикаторСессии) Тогда	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =НСтр("ru = 'Вход в ИС ЭСФ успешно выполнен.'");
		Сообщение.Сообщить();				
		ЭСФСервер.ЗакрытьСессию(ДанныеПрофиляИСЭСФ, ИдентфикаторСессии);
	КонецЕсли;	  
	
КонецПроцедуры
