#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АВРСерверПереопределяемый.АВРФормаСпискаИВыбораПриСозданииНаСервере(ЭтаФорма);

	УстановитьУсловноеОформление();
	
	ПараметрыЗапроса = ПараметрыЗапросаСписокДокументовКОформлению();
	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		СписокДокументовКОформлению.Параметры.УстановитьЗначениеПараметра(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	ЗаполнитьСписокДокументовКОформлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = АВРКлиентСервер.ИмяСобытияЗаписьАВР() Тогда
		Элементы.СписокДокументовКОформлению.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОформитьЭАВР(Команда)
	
	ТекущаяСтрока = Элементы.СписокДокументовКОформлению.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Укажите документ-основания для формирования электронных актов выполненных работ.'"));
		Возврат;
	КонецЕсли;
	
	АВРКлиент.СоздатьАВР(ТекущаяСтрока.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаИсходящиеЭлектронныеАВРОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	АВРКлиент.ОткрытьФормуСпискаИсходящихАВР();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	АВРКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДокументовКОформлению,
		"Организация",
		Организация,
		ВидСравненияКомпоновкиДанных.Равно, ,
		ЗначениеЗаполнено(Организация));
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	АВРКлиентСерверПереопределяемый.УстановитьЭлементОтбораДинамическогоСписка(
		СписокДокументовКОформлению,
		"Контрагент",
		Контрагент,
		ВидСравненияКомпоновкиДанных.Равно, ,
		ЗначениеЗаполнено(Контрагент));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовКОформлениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	ПоказатьЗначение(, ТекДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументовКОформлению()
	
	УстановитьТекстЗапросаСписокДокументовКОформлению();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗапросаСписокДокументовКОформлению()
	
	ТекстЗапроса = АВРСерверПереопределяемый.ТекстЗапросаДокументовКОформлениюЭАВР();
	СписокДокументовКОформлению.ТекстЗапроса = ТекстЗапроса;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыЗапросаСписокДокументовКОформлению()
	
	Параметры = Новый Структура;
	Параметры.Вставить("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#КонецОбласти